backend/app/services/bidding_service.rb

SELECT `biddings`.* FROM `biddings` WHERE `biddings`.`product_id` IS NULL ORDER BY days DESC
---
	def self.get_free_bid_dates(params)
		bid_values = []
		remaining_dates = []
		clashing_dates = {}
		removed_dates = []
		best_bids = {}
		bid_ids = []
		dates = []
		bids = Bidding.where(:product_id => params[:pid]).order("days DESC")

SELECT `products`.* FROM `products` WHERE `products`.`id` IS NULL
SELECT COUNT(*) FROM `biddings` WHERE `biddings`.`product_id` = 1
SELECT `products`.* FROM `products`
---
	def self.get_bid_count(params)

		count = []
		if params
			id = params[:uid]
			Product.where(:id => id).each do |bid|
				temp_count = {}
				temp_count[bid.id] = Bidding.where(:product_id => bid.id).count
				count << temp_count
			end
		elsif
			Product.all.each do |bid|
				temp_count = {}
				temp_count[bid.id] =  Bidding.where(:product_id => bid.id).count

SELECT `biddings`.* FROM `biddings` WHERE (from_date >= '2018-07-01' and to_date <= '2018-12-01' ) ORDER BY from_date ASC
SELECT `biddings`.* FROM `biddings` WHERE (from_date >= '2018-07-01' and to_date <= '2018-12-01' and product_id = 1) ORDER BY from_date ASC
---
	def self.total_bid_count(params)
		month = {}
		params[:pid] = 1
		if params[:pid]
			dates = Bidding.where('from_date >= ? and to_date <= ? and product_id = ?', Date.today.beginning_of_month - 1.month, Date.today.beginning_of_month + 4.month, params[:pid]).order("from_date ASC")
		else
			dates = Bidding.where('from_date >= ? and to_date <= ? ', Date.today.beginning_of_month - 1.month, Date.today.beginning_of_month + 4.month).order("from_date ASC")
		end
		temp = []
		count = {}

		dates.each do |date|

SELECT `biddings`.* FROM `biddings` WHERE (user_id = '1' and product_id = '1') ORDER BY from_date ASC
INSERT INTO `biddings` (`from_date`, `to_date`, `days`, `markup`, `created_at`, `updated_at`, `user_id`, `product_id`, `status`) VALUES ('2018-08-07 00:00:00', '2018-08-07 00:00:00', 4, 30, '2018-08-09 14:54:01', '2018-08-09 14:54:01', 2, 1, 1)
DELETE FROM `biddings` WHERE `biddings`.`id` = 7
---
	def self.approve_bid_dates
		bid_id = 9
		user_id = 2
		bidding = ''
		dates = ['2018-08-07', '2018-08-08', '2018-08-09']
		bid_details = Bidding.find_by(:id => bid_id)
		dates.each do |date|
			bidding =	Bidding.create(:from_date => date, :to_date => date, :days => bid_details.days, :markup => bid_details.markup, :user_id => user_id, :product_id => bid_details.product_id, :status => 1)
		end

		if bidding and Bidding.delete(65)