backend/app/services/user_product_service.rb

SELECT `user_products`.* FROM `user_products` INNER JOIN `products` ON `products`.`id` = `user_products`.`product_id` WHERE `user_products`.`user_id` = 1
---
	def self.get_user_products(params)
		id = params[:uid].to_i
		products = UserProduct.where(:user_id => id).to_json(:include => {:product => { }})