backend/app/controllers/application_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def authenticate_request!
    unless user_id_in_token?
      render json: {errors: ['Not Authenticated']}, status: :unauthorized
      return
    end
    @current_user = User.find(auth_token[:user_id])