backend/app/controllers/biddings_controller.rb

INSERT INTO `biddings` (`from_date`, `to_date`, `days`, `markup`, `created_at`, `updated_at`, `user_id`, `product_id`) VALUES ('2018-08-06 00:00:00', '2018-08-09 00:00:00', 92, 10, '2018-08-10 10:54:36', '2018-08-10 10:54:36', 1, 1)
---
  def create
    days = (Date.parse(to_date).mjd - Date.parse(from_date).mjd).to_i + 1

    @bidding = Bidding.new(:from_date => bidding_params[:from_date], :to_date => bidding_params[:to_date], :days => days, :markup => bidding_params[:markup], :user_id => bidding_params[:user_id], :product_id => bidding_params[:product_id], :status => 0)

    if @bidding.save

SELECT  `biddings`.* FROM `biddings` WHERE `biddings`.`id` = 1 LIMIT 1
---
    def set_bidding
      @bidding = Bidding.find(params[:id])