backend/app/controllers/products_controller.rb

  def search
    search_key = params[:q]
    products = Product.where("name LIKE '%#{search_key}%'")
---
SELECT `products`.* FROM `products` WHERE (name LIKE '%%')