backend/app/controllers/user_products_controller.rb

SELECT `user_products`.* FROM `user_products` WHERE `user_products`.`user_id` IS NULL
---
  def user_products
    count = BiddingService.get_bid_count(params)
    products = UserProduct.where(:user_id => params[:uid]).to_json(:include => {:product => { }})

SELECT  `user_products`.* FROM `user_products` WHERE `user_products`.`id` = 0 LIMIT 1
---
    def set_user_product
      @user_product = UserProduct.find(params[:id])